app/Http/Controllers/User/PostController.php

    public function show(Post $post): Response
    {
        return response()->view('.user.post.show', [
            'post' => $post->load(['author', 'category'])
        ]);
---
select * from `categories` where `categories`.`id` in (9)
select * from `users` where `users`.`id` in (2)