app/Http/Controllers/Author/PostController.php

select * from `categories` where `categories`.`id` in (9)
select * from `categories` where `categories`.`id` in (10)
---
    public function edit(Post $post): Response
    {
        return response()->view('author.post.edit', [
            'categories' => $this->categoryService->getCategories(),
            'post' => $post->load(['category', 'author'])
        ]);