app/Repositories/Impl/CategoryRepositoryImpl.php

select count(*) as aggregate from `categories`
---
    public function getCategoriesPagination(int $perPage = 9): LengthAwarePaginator
    {
        return Category::withCount('posts')
            ->latest()
            ->paginate($perPage);

update `categories` set `name` = 'category baru update111', `slug` = 'category-baru-update111', `categories`.`updated_at` = '2026-04-27 04:39:33' where `id` = 12
---
    public function updateCategory(Category $category, array $data): bool
    {
        return $category->update($data);

select * from `posts` where `posts`.`category_id` in (1)
---
    public function findBySlug(Category $category): Category
    {
        return $category->load(['posts']);

select count(*) as aggregate from `categories`
---
    public function totalCategories(): ?int
    {
        return Category::query()
            ->count();

select * from `categories` order by `name` asc
---
    public function getCategories(): Collection
    {
        return Category::orderBy('name', 'asc')->get();

select count(*) as aggregate from `categories`
---
    public function getCategoriesWithTotalPublishedPosts(int $perPage): LengthAwarePaginator
    {
        return Category::query()
            ->withCount(['posts' => function ($query) {
                $query->where('is_published', true);
            }])->latest()
            ->paginate($perPage);