app/Repositories/Impl/PostRepositoryImpl.php

select * from `users` where `users`.`id` = 2 limit 1
insert into `posts` (`title`, `slug`, `category_id`, `body`, `image`, `user_id`, `updated_at`, `created_at`) values ('dakcal;kcl;ak', 'dakcalkclak', '12', '<div>clsc;lakcka</div>', 'post-images/6p5xtISp5vdmw4hIRftYnlJHiCEkJudVt3nAaTq2.jpg', 2, '2026-04-28 02:25:29', '2026-04-28 02:25:29')
---
    public function createPost(array $data): Post
    {
        // $data['user_id'] = Auth::user()->id;
        // return Post::query()->create($data);

        $user = User::query()->findOrFail(Auth::user()->id);
        return $user->posts()->create($data);

update `posts` set `title` = 'artikel baru update', `slug` = 'artikel-baru-update', `posts`.`updated_at` = '2026-04-27 03:39:27' where `id` = 73
---
    public function updatePost(Post $post, array $data): bool
    {
        return $post->update($data);

delete from `posts` where `id` = 21
---
    public function removePost(Post $post): bool
    {
        return $post->delete();

select * from `categories` where `categories`.`id` in (12)
---
    public function findBySlug(Post $post): Post
    {
        return $post->load(['category', 'author']);

select count(*) as aggregate from `posts`
---
    public function totalAllPosts(): ?int
    {
        return Post::query()
            ->with(['author', 'category'])
            ->count();

select count(*) as aggregate from `posts` where `is_published` = 1
---
    public function totalPublishedPosts(): ?int
    {
        return Post::query()
            ->with(['author', 'category'])
            ->where('is_published', true)
            ->count();

select count(*) as aggregate from `posts` where `is_published` = 0
---
    public function totalPendingPosts(): ?int
    {
        return Post::query()
            ->with(['author', 'category'])
            ->where('is_published', false)
            ->count();

select * from `categories` where `categories`.`id` in (2, 4, 6, 7, 9, 10)
select * from `posts` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `posts`
---
    public function getPostsPagination(int $page): LengthAwarePaginator
    {
        return Post::query()
            ->with(['category', 'author'])
            ->latest()
            ->paginate($page);

select * from `categories` where `categories`.`id` in (2, 3, 4, 7, 10)
select count(*) as aggregate from `posts` where `is_published` = 0
---
    public function getPendingPosts(int $perPage): LengthAwarePaginator
    {
        return Post::query()
            ->withCount(['author', 'category'])
            ->where('is_published', false)
            ->paginate($perPage);

select * from `categories` where `categories`.`id` in (2, 4, 6, 9, 10, 12)
select * from `posts` where `is_published` = 1 order by `updated_at` desc limit 4
---
    public function recentActivity(): Collection
    {
        return Post::query()
            ->with(['author', 'category'])
            ->where('is_published', true)
            ->latest('updated_at')
            ->take(4)
            ->get();

select * from `categories` where `categories`.`id` in (2, 4, 6, 9, 10)
select * from `posts` where `user_id` = 2 order by `created_at` desc limit 9 offset 0
select count(*) as aggregate from `posts` where `user_id` = 2
---
    public function getPostsByAuthorId(int $authorId, int $perPage = 9): ?LengthAwarePaginator
    {
        return Post::query()
            ->with(['category', 'author'])
            ->where('user_id', $authorId)
            ->latest()
            ->paginate($perPage);

select * from `categories` where `categories`.`id` in (2, 6, 9, 10)
select count(*) as aggregate from `posts` where `user_id` = 2
---
    public function totalPostsByAuthor(int $authorId): ?int
    {
        return Post::query()
            ->with(['category', 'author'])
            ->where('user_id', $authorId)
            ->count();

select * from `categories` where `categories`.`id` in (6, 9, 10, 12)
select * from `posts` where `user_id` = 2 order by `created_at` desc limit 5
---
    public function getRecentPostsByAuthor(int $authorId): Collection
    {
        return Post::query()
            ->with(['category', 'author'])
            ->where('user_id', $authorId)
            ->take(5)
            ->latest()
            ->get();

select * from `categories` where `categories`.`id` in (2, 3, 4, 7)
select count(*) as aggregate from `posts` where `user_id` = 2 and `is_published` = 0
---
    public function totalPendingPostsByAuthor(int $authorId): ?int
    {
        return Post::query()
            ->with(['category', 'author'])
            ->where('user_id', $authorId)
            ->where('is_published', false)
            ->count();

select * from `posts` where `user_id` = 2 and `is_published` = 0 limit 9 offset 0
select count(*) as aggregate from `posts` where `user_id` = 2 and `is_published` = 1
---
    public function getPendingPostsByAuthor(int $authorId, int $perPage): LengthAwarePaginator
    {
        return Post::query()
            ->with(['category', 'author'])
            ->where('user_id', $authorId)
            ->where('is_published', false)
            ->paginate($perPage);

select * from `categories` where `categories`.`id` in (2, 4, 6, 9, 10)
select count(*) as aggregate from `posts` where `user_id` = 2 and `is_published` = 1
---
    public function totalPublishedPostsByAuthor(int $authorId): ?int
    {
        return Post::query()
            ->with(['category', 'author'])
            ->where('user_id', $authorId)
            ->where('is_published', true)
            ->count();

select * from `posts` where `user_id` = 2 and `is_published` = 1 limit 9 offset 0
select * from `categories` where `categories`.`id` in (2, 4, 6, 9, 10)
---
    public function getPublishedPostsByAuthor(int $authorId, int $perPage): LengthAwarePaginator
    {
        return Post::query()
            ->with(['category', 'author'])
            ->where('user_id', $authorId)
            ->where('is_published', true)
            ->paginate($perPage);

select * from `categories` where `categories`.`id` in (6, 9, 10)
select * from `posts` where `is_published` = 1 order by `created_at` desc limit 3
---
    public function getUserRecentPosts(): Collection
    {
        return Post::query()
            ->with(['category', 'author'])
            ->where('is_published', true)
            ->take(3)
            ->latest()
            ->get();

select * from `categories` where `categories`.`id` in (2, 4, 6, 9, 10)
select * from `posts` where `is_published` = 1 order by `created_at` desc limit 9 offset 0
select count(*) as aggregate from `posts` where `is_published` = 1
---
    public function getUserPublishedPosts(int $perPage = 9): LengthAwarePaginator
    {
        return Post::query()
            ->with(['category', 'author'])
            ->where('is_published', true)
            ->latest()
            ->paginate($perPage);

select * from `categories` where `categories`.`id` in (7)
select * from `posts` where `is_published` = 1 and `category_id` = 7 order by `created_at` desc limit 6 offset 0
select count(*) as aggregate from `posts` where `is_published` = 1 and `category_id` = 7
---
    public function getPublishedPostsByCategory(int $categoryId, int $perPage = 9): LengthAwarePaginator
    {
        return Post::query()
            ->with(['category', 'author'])
            ->where('is_published', true)
            ->where('category_id', $categoryId)
            ->latest()
            ->paginate($perPage);